templates/manifold_2d/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform {{ p_in_ref }};

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

{% for name in outlet_names %}
    {{ name }}
    {
        type            fixedValue;
        value           uniform {{ p_out }};
    }
{% endfor %}

    walls
    {
        type            zeroGradient;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
}

