templates/manifold_2d/system/decomposeParDict.j2
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains {{ n_cores }};

method scotch;

